Repository: pavelmakis/telexpense
Catalog: locales/*/LC_MESSAGES/telexpense.po
Languages: ru

source: Where do you want to make the payment from?
ru: Откуда вы хотите совершить платеж?

source: OK, next time
ru: Хорошо, в следующий раз

source: To transfer money tap the first button, you will be redirected to the payment page
ru: Чтобы перевести деньги, нажмите первую кнопку. Вы будете перенаправлены на страницу оплаты

source: *🙏 Thank you for supporting my creator for {total_amount} {currency}!* 🤔 Maybe now he can come up with even more functionality for me
ru: *🙏 Спасибо за поддержку моего создателя на {total_amount} {currency}!* 🤔 Может быть теперь у него будет стимул реализовать больше функционала для меня

source: The minimum amount is 3€. If you want to donate a different amount, tap "Pay" and enter the amount of the tip, which will be added to the minimum amount
ru: Минимальный платеж 3€. Если вы хотите отправить другую сумму, нажмите "Оплатить" и введите сумму чаевых (tip), которая будет добавлена к минимальному платежу

source: Donation to developer
ru: Пожертвование разработчику

source: This is a voluntary donation to my creator.
ru: Это добровольное пожертвование моему создателю.

source: Specify an amount of expense or type "cancel"
ru: Укажите сумму расхода или наберите "отмена"

source: 😳 Something went wrong... Please try again later. If it does not work again, check your table or add it again via /register. Maybe you have changed the table and I can no longer work with it
ru: 😳 Что-то пошло не так... Пожалуйста, попробуйте позже. Если снова не получится, проверьте свою таблицу или добавьте ее заново через /register. Возможно вы изменили таблицу и я не могу больше с ней работать

source: ❌ Cannot understand this amount... Try to add /expense one more time!
ru: ❌ Не могу понять эту сумму... Попробуйте добавить /expense еще раз!

source: Specify a category of expense
ru: Выберите категорию расхода

source: ❌ This outcome category doesn't exist... Try to add /expense one more time!
ru: ❌ Такой категории расходов не существует... Попробуйте добавить /expense еще раз!

source: Specify an account
ru: Выберите счет

source: ❌ This account doesn't exist... Try to add /expense one more time!
ru: ❌ Такого счета не существует... Попробуйте добавить /expense еще раз!

source: Specify a description
ru: Укажите описание

source: 👍 Successfully added {amount} to {cat} from {account}!
ru: 👍 Успешно добавлено {amount} в {cat} с {account}!

source: Expense can be added by: `/addexp amount, category, [account], [description]` where account and description are optional. Example: `/addexp 3.45, taxi, Revolut, From work` `/addexp 9.87, Groceries, N26`
ru: Расход может быть добавлен так: `/addexp сумма, категория, [счет], [описание]` где счет и описание необязательны. Пример: `/addexp 300, такси, Тинькофф, Дорога домой` `/addexp 380.7, Продукты, Альфа Банк`

source: Cannot understand this expense! Expense can be added by: `/addexp amount, category, [account], [description]` where account and description are optional. Example: `/addexp 3.45, taxi, Revolut, From work` `/addexp 9.87, Groceries, N26`
ru: Не могу понять этот расход! Расход может быть добавлен так: `/addexp сумма, категория, [счет], [описание]` где счет и описание необязательны. Пример: `/addexp 300, такси, Тинькофф, Дорога домой` `/addexp 380.7, Продукты, Альфа Банк`

source: Cannot understand this expense! Looks like amount is wrong!
ru: Не могу понять этот расход! Похоже, сумма неверна!

source: Cannot understand this expense! Looks like this category doesn't exist!
ru: Не могу понять этот расход! Похоже, такой категории не существует!

source: Cannot understand this expense! Looks like this account doesn't exist!
ru: Не могу понять этот расход! Похоже, такого счета не существует!

source: 👍 Successfully added {amount} to {category}!
ru: 👍 Успешно добавлено {amount} на {category}!

source: Specify an amount of income or type "cancel"
ru: Укажите сумму дохода или напишите "отмена"

source: ❌ Cannot understand this amount... Try to add /income one more time!
ru: ❌ Не могу понять эту сумму... Попробуйте добавить /income еще раз!

source: Specify a category of income
ru: Укажите категорию дохода

source: ❌ This income category doesn't exist... Try to add /income one more time!
ru: ❌ Такой категории дохода не существует... Попробуйте добавить /income еще раз!

source: ❌ This account doesn't exist... Try to add /income one more time!
ru: ❌ Такого счета не существует... Попробуйте добавить /income еще раз!

source: 👍 Successfully added {amount} to {cat} to {account}!
ru: 👍 Успешно добавлено {amount} в {cat} на {account}!

source: Income can be added by: `/addinc amount, category, [account], [description]` where account and description are optional. Example: `/addinc 1200, Salary, N26, First job` `/addinc 20.20, Cashback, Revolut`
ru: Доход может быть добавлен так: `/addinc сумма, категория, [счет], [описание]` где счет и описание необязательны. Пример: `/addinc 60000, зарплата, Альфа Банк, Основная работа` `/addinc 894.4, кешбек, Тинькофф`

source: Cannot understand this income! Income can be added by: `/addinc amount, category, [account], [description]` where account and description are optional. Example: `/addinc 1200, Salary, N26, First job` `/addinc 20.20, Cashback, Revolut`
ru: Не могу понять этот доход! Доход может быть добавлен так: `/addinc сумма, категория, [счет], [описание]` где счет и описание необязательны. Пример: `/addinc 60000, зарплата, Альфа Банк, Основная работа` `/addinc 894.4, кешбек, Тинькофф`

source: Cannot understand this income! Looks like amount is wrong!
ru: Не могу понять этот доход! Похоже, сумма неверна!

source: Cannot understand this income! Looks like this income category doesn't exist!
ru: Не могу понять этот доход! Похоже, такой категории дохода не существует!

source: Cannot understand this income! Looks like this account doesn't exist!
ru: Не могу понять этот доход Похоже, такого счета не существует!

source: Cancel
ru: Отмена

source: Choose bot's language
ru: Выберите язык бота

source: OK, mext time
ru: Хорошо, в следующий раз

source: Setting selected language...
ru: Устанавливаю выбранный язык…

source: Success! For the changes to take effect, run any command
ru: Успешно! Чтобы изменения вступили в силу, выполните любую команду

source: OK, nex time!
ru: Хорошо, в следующий раз!

source: What is the main currency of your finances? If your currency is not in the list, unfortunately, you will have to adjust the currency and format manually in the table
ru: Какая основная валюта ваших финансов? Если вашей валюты нет в списке, к сожалению, вам придется настроить валюту и ее формат вручную в таблице

source: 😥 Sorry, this currency cannot be set up through me yet. You can do this manually on the Preferences page in your sheet.
ru: 😥 Простите, эта валюта пока не может быть настроена через меня. Но вы можете сделать это вручную на листе Preferences в вашей таблице.

source: Please select a currency format that suits you best
ru: Пожалуйста, выберите формат валюты, который вам подходит

source: 😳 Sorry, I cannot understand this format. Change something and try /currency again later
ru: 😳 Простите, я не могу понять такой формат. Измените что-нибудь и попробуйте настроить /currency позже

source: Setting main currency...
ru: Устанавливаю основную валюту...

source: Updating formats...
ru: Обновляю форматы...

source: Success!
ru: Успешно!

source: You are already registered user! You can either connect me to a new Google Sheet or delete a connected sheet from the database
ru: Вы уже зарегистрированный пользователь! Вы можете либо сменить таблицу, к которой я подключен, либо отключить меня от таблицы

source: Looks like you are new here... If you want to use me, connect me to new Google Sheet
ru: Кажется, вы здесь новенький... Если вы хотите использовать меня, подключите меня к Google Таблице

source: *STEP 1* Copy this Google Sheet template to your Google account. You do this to ensure that your financial data belongs only to you. 👉 [Telexpense Template Sheet]({sheet}) 👈
ru: *ШАГ 1* Скопируйте этот шаблон Google Таблицы к себе в аккаунт Google. Вы делаете это, чтобы все данные о ваших средствах принадлежали только вам. 👉 [Шаблон таблицы Telexpense]({sheet}) 👈

source: Are you sure? After that you have to /register again to use me
ru: Вы уверены? После этого вам придется снова пройти /register чтобы использовать меня

source: *STEP 2* Add me to the table as an editor so I can add transactions and read the balance. Here is my email: {email}
ru: *ШАГ 2* Добавьте меня в таблицу в роли редактора, чтобы я мог добавлять транзакции и читать данные баланса. Вот моя почта: {email}

source: *STEP 3* Copy the link to the table in your account and send it to this chat. It is necessary for me to remember you
ru: *ШАГ 3* Скопируйте ссылку на таблицу в вашем аккаунте и отправьте ее в этот чат.Это необходимо, чтобы я вас запомнил

source: Checking this sheet...
ru: Проверяю эту таблицу...

source: Your sheet successfully changed! Don't forget to select the main currency and its format in /currency and set bots language in /language
ru: Ваша таблица успешно изменена! Не забудьте выбрать основную валюту и ее формат в /currency, а также выбрать язык бота в /language

source: Great, you are in! Don't forget to select the main currency and its format in /currency and set bots language in /language
ru: Здорово! Вы в деле! Не забудьте выбрать основную валюту и ее формат в /currency, а также выбрать язык бота в /language

source: Hm. Looks like it's not a link I'm looking for... Read the [wiki]({wiki}) and try to /register one more time!
ru: Хм, кажется, это не та ссылка, которую я ищу... Почитайте [вики]({wiki}) и попробуйте /register еще раз!

source: See you next time!
ru: До скорой встречи!

source: Specify an amount of transfer or type "cancel"
ru: Укажите сумму перевода или напишите "отмена"

source: ❌ Cannot understand this amount... Try to add /transfer one more time!
ru: ❌ Не могу понять эту сумму... Попробуйте добавить /transfer еще раз!

source: Specify the account from which the money was transferred
ru: Укажите счет с которого списали деньги

source: ❌ This account doesn't exist... Try to add /transfer one more time!
ru: ❌ Такого счета не существует... Попробуйте добавить /transfer еще раз!

source: Specify the amount added to the account to which the transfer was made. If the amounts are the same, tap "Same amount"
ru: Укажите сумму, зачисленную на счет, на который были переведены деньги Если сумма не поменялась, нажмите "Такая же сумма"

source: Specify the account to which the money was transferred
ru: Укажите счет, на который были переведены деньги

source: 👍 Successfully added transfer from {account1} to {account2}!
ru: 👍 Успешно добавлен перевод с {account1} на {account2}!

source: Transfer can be added by: `/addtran outcome_amount, outcome\_account, [income\_amount], income\_account` where income amount is optional\. Add it if your transaction is multicurrency\. Example: `/addtran 1200, Revolut, N26` `/addtran 200, Revolut EUR, 220.3, Revolut USD`
ru: Перевод может быть добавлен так: `/addtran сумма\_списания, счет\_списания, [сумма\_зачисления], счет\_зачисления` где сумма\_зачисления необязательна\. Добавьте ее если вы переводите деньги в другую валюту\. Пример: `/addtran 1200, Тинькофф, Альфа` `/addtran 200, Тинькофф EUR, 220.3, Тинькофф USD`

source: Cannot understand this transaction\! Transfer can be added by: `/addtran outcome\_amount, outcome\_account, [income\_amount], income\_account` where income\_amount is optional\. Add it if your transaction is multicurrency\. Example: `/addtran 1200, Revolut, N26` `/addtran 200, Revolut EUR, 220.3, Revolut USD`
ru: Не могу понять этот перевод\! Перевод может быть добавлен так: `/addtran сумма\_списания, счет\_списания, [сумма\_зачисления], счет\_зачисления` где сумма\_зачисления необязательна\. Добавьте ее если вы переводите деньги в другую валюту\. Пример: `/addtran 1200, Тинькофф, Альфа` `/addtran 200, Тинькофф EUR, 220.3, Тинькофф USD`

source: Cannot understand this transaction! Looks like outcome amount is wrong!
ru: Не могу понять этот перевод Похоже, сумма списания неверна!

source: Cannot understand this transaction! Looks like this outcome account doesn't exist!
ru: Не могу понять этот перевод! Похоже, такого счета списания не существует!

source: Cannot understand this transaction! Looks like income amount is wrong!
ru: Не могу понять этот перевод! Похоже, сумма зачисления неверна!

source: Cannot understand this transaction! Looks like this income account doesn't exist!
ru: Не могу понять этот перевод! Похоже, такого счета зачисления не существует!

source: 👍 Successfully added transaction from {account1} to {account2}!
ru: 👍 Успешно добавлен перевод с {account1} на {account2}!

source: Hi! I'm Telexpense bot 📺 I can help you manage your finances in Google Sheet. If you are a new user, read the [wiki]({wiki}) or type /register to start using me
ru: Привет, я бот Telexpense📺 Пример

source: I can help you manage your finances in Google Sheet. If you don't understand something, check out [this wiki]({wiki}) I can understand these commands: *Add records* /expense (➖Expense) - add new expense /income (➕Income) - add new income /transfer (💱Transfer) - add new transfer /cancel - cancel record filling /addexp - add expense in a single message /addinc - add income in a single message /addtran - add transaction in a single message *Show balance* /available (💲Available) - show your accounts balances *Revert changes* /undo - delete last transaction from Google Sheet *Settings* /currency - set main currency and its format /language - set bot's language /register - connect me to Google Sheet or change connected sheet *Other* /donate - sponsor this project
ru: Я могу помочь вам управлять вашими финансами в Google Таблице. Если вам что-то непонятно, почитайте [эту вики]({wiki}) Я могу понять следующие команды: *Добавление транзакций* /expense (➖Расход) - добавить новый расход /income (➕Доход) - добавить новый доход /transfer (💱Перевод) - добавить новый перевод /cancel - отменить добавление транзакции /addexp - добавить расход одной командой /addinc - добавить доход одной командой /addtran - добавить перевод одной командой *Просмотр баланса* /available (💲Баланс) - прислать баланс счетов *Отмена изменений* /undo - удалить последнюю добавленную транзакцию *Настройки* /currency - установить основную валюту и ее формат /language - выбрать язык бота /register - подключить новую таблицу или изменить существующую *Другое* /donate - поддержать развитие проекта

source: I can only work with registered users! Read the [wiki]({wiki}) or type /register
ru: Я могу работать только с зарегистрированными пользователями! Почитайте [вики]({wiki}) или напишите /register

source: Can cancel only while filling a form. Nothing to cancel now!
ru: Я могу отменять что-то только при заполнении транзакции. Сейчас нечего отменять!

source: Cancelled
ru: Отменено

source: 💰 Your accounts:
ru: 💰 Ваши счета:

source: *Daily available:*
ru: *Доступно в день:*

source: Wait a second...
ru: Секундочку...

source: 🤔 Looks like there is no transactions...
ru: 🤔 Кажется, в таблице нет транзакций…

source: 👌 Successfully deleted last transaction!
ru: 👌 Последняя транзакция успешно удалена!

source: 🇷🇺 Russia
ru: 🇷🇺 Россия

source: 🌍 Other world
ru: 🌍 Остальной мир

source: Pay
ru: Оплатить

source: Connect new Google Sheet
ru: Подключить новую Google Таблицу

source: Change connected Google Sheet
ru: Сменить Google Таблицу

source: Forget my Google Sheet
ru: Отключить мою Google Таблицу

source: Done
ru: Готово

source: I understand
ru: Подтверждаю

source: ➕Income
ru: ➕Доход

source: ➖Expense
ru: ➖Расход

source: 💱Transfer
ru: 💱Перевод

source: 💲Available
ru: 💲Баланс

source: No description
ru: Без описания

source: Same amount
ru: Такая же сумма
